Importing the libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import geopandas as gpd
import seaborn as sns

Importing Dataset

In [2]:
df = pd.read_csv(r"/Users/vidushigupta/Desktop/Vidushi/COVID dataset/state_wise_daily.csv", parse_dates=['Date'])
df.head(5)

,Date,Status,TT,AN,AP,AR,AS,BR,CH,CT,...,PB,RJ,SK,TN,TG,TR,UP,UT,WB,UN
0,2020-03-14,Confirmed,81,0,1,0,0,0,0,0,...,1,3,0,1,1,0,12,0,0,0
1,2020-03-14,Recovered,9,0,0,0,0,0,0,0,...,0,1,0,0,0,0,4,0,0,0
2,2020-03-14,Deceased,2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,2020-03-15,Confirmed,27,0,0,0,0,0,0,0,...,0,1,0,0,2,0,1,0,0,0
4,2020-03-15,Recovered,4,0,0,0,0,0,0,0,...,0,2,0,0,1,0,0,0,0,0

Cleaning and Preparing Data for visualization

In [3]:
indexNames = df[ df['Status'] == 'Deceased'].index
df.drop(indexNames , inplace=True)
indexNames = df[ df['Status'] == 'Recovered'].index
df.drop(indexNames , inplace=True)
indexNames = df[ df['Status'] == 'Latitude'].index
df.drop(indexNames , inplace=True)
indexNames = df[ df['Status'] == 'Longitude'].index
df.drop(indexNames , inplace=True)
df.head(5)

,Date,Status,TT,AN,AP,AR,AS,BR,CH,CT,...,PB,RJ,SK,TN,TG,TR,UP,UT,WB,UN
0,2020-03-14,Confirmed,81,0,1,0,0,0,0,0,...,1,3,0,1,1,0,12,0,0,0
3,2020-03-15,Confirmed,27,0,0,0,0,0,0,0,...,0,1,0,0,2,0,1,0,0,0
6,2020-03-16,Confirmed,15,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0
9,2020-03-17,Confirmed,11,0,0,0,0,0,0,0,...,0,0,0,0,1,0,2,0,1,0
12,2020-03-18,Confirmed,37,0,0,0,0,0,0,0,...,1,3,0,1,8,0,2,1,0,0

In [4]:
df_1=df.drop(['Status'], axis=1)

In [5]:
df_1.set_index(pd.DatetimeIndex(df_1['Date']), inplace=True)

In [6]:
df_2=df_1.drop(['Date'], axis=1)
df_2.head(5)

,TT,AN,AP,AR,AS,BR,CH,CT,DN,DD,...,PB,RJ,SK,TN,TG,TR,UP,UT,WB,UN
Date,,,,,,,,,,,,,,,,,,,,,
2020-03-14,81,0,1,0,0,0,0,0,0,0,...,1,3,0,1,1,0,12,0,0,0
2020-03-15,27,0,0,0,0,0,0,0,0,0,...,0,1,0,0,2,0,1,0,0,0
2020-03-16,15,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0
2020-03-17,11,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,2,0,1,0
2020-03-18,37,0,0,0,0,0,0,0,0,0,...,1,3,0,1,8,0,2,1,0,0

In [7]:
df_3=df_2.resample('M').sum()
df_3.head()

,TT,AN,AP,AR,AS,BR,CH,CT,DN,DD,...,PB,RJ,SK,TN,TG,TR,UP,UT,WB,UN
Date,,,,,,,,,,,,,,,,,,,,,
2020-03-31,1635,10,44,0,1,21,15,9,0,0,...,42,93,0,124,97,0,104,7,37,0
2020-04-30,33231,23,1359,1,42,404,59,31,0,0,...,438,2491,0,2199,941,3,2107,50,721,0
2020-05-31,155779,0,2168,3,1297,3382,219,458,2,0,...,1783,6247,1,20010,1660,313,5864,850,4743,5491
2020-06-30,190446,12,3925,102,3564,3233,81,1448,58,0,...,1352,5026,69,30001,3329,838,7710,1196,7234,3212

In [8]:
df_4=df_3.transpose()
df_4.head()

Date  2020-03-31  2020-04-30  2020-05-31  2020-06-30
TT          1635       33231      155779      190446
AN            10          23           0          12
AP            44        1359        2168        3925
AR             0           1           3         102
AS             1          42        1297        3564

In [9]:
df_5=df_4.drop(['TT','UN'])
df_5.head()

Date  2020-03-31  2020-04-30  2020-05-31  2020-06-30
AN            10          23           0          12
AP            44        1359        2168        3925
AR             0           1           3         102
AS             1          42        1297        3564
BR            21         404        3382        3233

In [10]:
df_5.reset_index(level=0, inplace=True)
df_5.head()

Date,index,2020-03-31 00:00:00,2020-04-30 00:00:00,2020-05-31 00:00:00,2020-06-30 00:00:00
0,AN,10,23,0,12
1,AP,44,1359,2168,3925
2,AR,0,1,3,102
3,AS,1,42,1297,3564
4,BR,21,404,3382,3233

In [11]:
df_11=df_5.set_axis(['States','March', 'April','May','June'], axis=1, inplace=False)
df_11.head()

  States  March  April   May  June
0     AN     10     23     0    12
1     AP     44   1359  2168  3925
2     AR      0      1     3   102
3     AS      1     42  1297  3564
4     BR     21    404  3382  3233

In [12]:
df_11=df_11.drop(['June'], axis=1)
df_11.head()

  States  March  April   May
0     AN     10     23     0
1     AP     44   1359  2168
2     AR      0      1     3
3     AS      1     42  1297
4     BR     21    404  3382

In [13]:
df_11.at[14,'March']= 68
df_11.at[14,'April']= 568
df_11.at[14,'May']= 1602
df_11.drop(18, inplace=True)
df_11.head()

  States  March  April   May
0     AN     10     23     0
1     AP     44   1359  2168
2     AR      0      1     3
3     AS      1     42  1297
4     BR     21    404  3382

In [14]:
df_11.reset_index(level=0, inplace=True)
df_11.drop('index', axis=1, inplace=True)
df_11.tail()

   States  March  April   May
31     TG     97    941  1660
32     TR      0      3   313
33     UP    104   2107  5864
34     UT      7     50   850
35     WB     37    721  4743

In [15]:
df_11.to_csv('clean_data.csv', index='False')